app/controllers/school_classes_controller.rb

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-07-01 02:54:25.111355"], ["id", 1]]
---
  def update
    @school_class.update(params.require(:school_class))